In [119]:
import numpy as np
import pandas as pd

lab=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

print("label:",lab)
print("my_data",my_data)
print("dictionary",d)
print("array",arr)

label: ['a', 'b', 'c']
my_data [10, 20, 30]
dictionary {'a': 10, 'b': 20, 'c': 30}
array [10 20 30]

In [120]:
pd.Series(data=my_data) #output looks like a table of data

0    10
1    20
2    30
dtype: int64

In [121]:
pd.Series(data=my_data,index=lab) #customized index no

a    10
b    20
c    30
dtype: int64

In [122]:
pd.Series(arr,lab)

a    10
b    20
c    30
dtype: int32

In [123]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# what values can pandas series hold

In [124]:
print("\nholding numerical data\n",'-'*25,sep="")
print(pd.Series(arr))
print("\nholding text labels\n",'-'*22,sep="")
print(pd.Series(lab))
print("\nholding functions\n",'-'*20,sep="")
print(pd.Series(data=[sum,print,len]))
print("\nholding obj from dictionary\n",'-'*40,sep="")
print(pd.Series(data=[d.keys,d.items,d.values]))

holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

holding text labels
----------------------
0    a
1    b
2    c
dtype: object

holding functions
--------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

holding obj from dictionary
----------------------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

# Accesing pandas

In [125]:
ser=pd.Series([1,2,3],['CA','OR','AZ'])
print(ser['CA'])
print(ser[0],ser[2])
print(ser[1:3])

1
1 3
OR    2
AZ    3
dtype: int64

# Addition in pandas

In [126]:
ser2=pd.Series([1,2,3],['CA','OR','NV'])
ser3=ser+ser2
print(ser3)

AZ    NaN
CA    2.0
NV    NaN
OR    4.0
dtype: float64

# Creating and accessing Data Frame
data frame is combinig of more than one element
1.indexing
2.Adding and deleting rows and columns
3.Subsetting DataFrame

In [1]:
from numpy.random import randn as rn
np.random.seed(101)  #sets a particular value and it wont change on next run
matrix_data = rn(5,4) #randn means it gives 5 rows 4 columns with random values
row_labels=['A','B','C','D','E']
column_headings=['W','X','Y','Z']

df=pd.DataFrame(data=matrix_data , index=row_labels ,columns=column_headings)
print("DataFrame looks like\n",'-'*45,sep="")
print(df)

NameError: name 'np' is not defined

# Indexing and Slicing(columns)

1.by bracket method

2.By DOT method (NOT recommended)

In [128]:
print(df['X'],type(df['X'])) #from above output

print(df[['X','Z']])

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64 <class 'pandas.core.series.Series'>
          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [129]:
#USing Dot method
print(df.X)

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

# Creating and Deleting a new column or Row

In [130]:
df['new']=df['X']+df['Z']
df['NewOne(sum of X and Y)']=df['X']+df['Y']
print(df)
df=df.drop('new',axis=1)#axis=0 is default it removes row 1 will remove col
print(df)
df1=df.drop('A')
print(df1)
df.drop("NewOne(sum of X and Y)",axis=1,inplace=True)
print(df)

          W         X         Y         Z       new  NewOne(sum of X and Y)
A  2.706850  0.628133  0.907969  0.503826  1.131958                1.536102
B  0.651118 -0.319318 -0.848077  0.605965  0.286647               -1.167395
C -2.018168  0.740122  0.528813 -0.589001  0.151122                1.268936
D  0.188695 -0.758872 -0.933237  0.955057  0.196184               -1.692109
E  0.190794  1.978757  2.605967  0.683509  2.662266                4.584725
          W         X         Y         Z  NewOne(sum of X and Y)
A  2.706850  0.628133  0.907969  0.503826                1.536102
B  0.651118 -0.319318 -0.848077  0.605965               -1.167395
C -2.018168  0.740122  0.528813 -0.589001                1.268936
D  0.188695 -0.758872 -0.933237  0.955057               -1.692109
E  0.190794  1.978757  2.605967  0.683509                4.584725
          W         X         Y         Z  NewOne(sum of X and Y)
B  0.651118 -0.319318 -0.848077  0.605965               -1.167395
C -2.018168  0.740122  0.528813 -0.589001                1.268936
D  0.188695 -0.758872 -0.933237  0.955057               -1.692109
E  0.190794  1.978757  2.605967  0.683509                4.584725
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Selecting/Indexing Rows
1.label based loc method
2.index(numeric) loc method

In [131]:
print(df,end="\n\n")
print(df.loc["C"],end="\n\n") #label based method used for selecting rows
print(df.loc[['B','C']],end="\n\n") 
print(df.iloc[2],end="\n\n")  #index based iloc method used for selecting rows
print(df.iloc[[1,2]],end="\n\n")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

# Subsetting DataFrame

In [3]:
from numpy.random import randn as rn
np.random.seed(100)
md=rn(4,5)
col=['A','B','C','D','E']
row=['1','2','3','4']
print("\nDataFrame\n","-"*50,sep="")
D=pd.DataFrame(data=md,index=row,columns=col)
print(D,end="\n\n")

print("\nElements at index 3 and col D\n",'-'*29,sep="")
print(D.loc['1','D'],end="\n\n")

print("\nElements at index 3,4 and col A,D\n",'-'*29,sep="")
print(D.loc[['3','4'],['A','D']])

DataFrame
--------------------------------------------------
          A         B         C         D         E
1 -1.749765  0.342680  1.153036 -0.252436  0.981321
2  0.514219  0.221180 -1.070043 -0.189496  0.255001
3 -0.458027  0.435163 -0.583595  0.816847  0.672721
4 -0.104411 -0.531280  1.029733 -0.438136 -1.118318


Elements at index 3 and col D
-----------------------------
-0.25243603652138985


Elements at index 3,4 and col A,D
-----------------------------
          A         D
3 -0.458027  0.816847
4 -0.104411 -0.438136

# Conditional selection,index (re)setting,multi-index
Basic idea of conditional check and Boolean Dataframe

In [133]:
print(df,end="\n\n")
print(df>0,end="\n\n") #checking if the values are greater than 0
print(df.loc[['A','B','C']]>0 ,end="\n\n")
booldf=df>0
print(df[booldf]) #dataframes indexed by boolean dataframes

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Missing Value

In [134]:
df=pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan]})
df['States']="CA NW AZ".split()
df.set_index('States',inplace=True)
print(df)

          A    B
States
CA      1.0  5.0
NW      2.0  NaN
AZ      NaN  NaN

# Panda Dropna Method

In [135]:
print(df.dropna(axis=0),end="\n\n")  #dropping any rows with Nan value
print(df.dropna(axis=1),end="\n\n") #dropping any col with Nan value
print(df.dropna(axis=0 ,thresh=1)) #dropping a row with a min Nan value 2

          A    B
States
CA      1.0  5.0

Empty DataFrame
Columns: []
Index: [CA, NW, AZ]

          A    B
States
CA      1.0  5.0
NW      2.0  NaN

# Panda fillna method

In [136]:
print(df.fillna(value="FILL VALUE")) #filling value with a default value
print(df.fillna(value=df['A'].mean())) #filing with the mean of col A

                 A           B
States
CA             1.0         5.0
NW             2.0  FILL VALUE
AZ      FILL VALUE  FILL VALUE
          A    B
States
CA      1.0  5.0
NW      2.0  1.5
AZ      1.5  1.5

# Panda GroupBy method

In [137]:
#create dataframe
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
      'sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [138]:
byComp=df.groupby('Company')
print(byComp.mean(),end="\n\n\n\n") #Grouping company col and listing mean sales
print(byComp.sum(),end="\n\n\n\n") #Grouping company col and listing sum of sales
#Note dataframe conversion of thes eries and transpose
print(pd.DataFrame(df.groupby('Company').describe().loc['FB']).transpose(),end="\n\n\n\n")
print(df.groupby('Company').describe().loc[['GOOG','MSFT']],end="\n\n\n\n")

         sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0



         sales
Company
FB         593
GOOG       320
MSFT       464



   sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0



        sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

# Merging ,Joining,Concatenation 

Concatenation

In [139]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                'B':['B0','B1','B2','B3'],
                'C':['C0','C1','C2','C3'],
                'D':['D0','D1','D2','D3']},
               index=[0,1,2,3])

df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                'B':['B4','B5','B6','B7'],
                'C':['C4','C5','C6','C7'],
                'D':['D4','D5','D6','D7']},
               index=[4,5,6,7])

df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                'B':['B8','B9','B10','B11'],
                'C':['C8','C9','C10','C11'],
                'D':['D8','D9','D10','D11']},
               index=[8,9,10,11])
print((df1),end="\n\n")
print((df2),end="\n\n")
print((df3),end="\n\n")

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [140]:
df_cat1 =pd.concat([df1,df2,df3],axis=0) #concatinating along row
print(df_cat1)
df_cat2 = pd.concat([df1,df2,df3],axis=1) #concatinating along col
print(df_cat2,end="\n\n")
df_cat2.fillna(value=0,inplace=True)
print(df_cat2)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  B5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

# Merging By a common key

Merge function allows you to manage Dataframe together using a similar logic as mergng SQL Tables together

In [141]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
print(left,end="\n\n")
print(right,end="\n\n")

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [142]:
merge1=pd.merge(left,right,how="inner",on="key")
print(merge1) #after merging with inner method

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# Merging on a set of keys

In [143]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                   'key2':['K0','K1','K0','K1'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                   'key2':['K0','K0','K0','K0'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [144]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [145]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [146]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [147]:
print(right)
print(left)
pd.merge(left,right,how="outer",on=['key1','key2'])

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3
  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [148]:
pd.merge(left,right,how="left",on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# joining
joining is a convinient method for combining the columns of 2 potentially different idexed df into a single df based on "index keys"

In [157]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index=['K0','K1','K2'])
right=pd.DataFrame({
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                  index=['K0','K1','K2','K3'])

In [161]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [158]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [159]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [160]:
left.join(right,how="outer")

      A    B   C   D
K0   A0   B0  C0  D0
K1   A1   B1  C1  D1
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [ ]:
Useful Operations

head() and unique values
1.head()
2.unique()
3.runique()
4.value_count()

In [199]:

df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                 'col2':[444,555,666,444,333,222,666,777,666,555],
                 'col3':"aaa bb c dd eeee fff gg h iii j".split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [169]:
df.head()#it is used for showing first few entries can also give values inside it

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee

In [170]:
print(df['col2'].unique()) #unique method applies to pd.series

[444 555 666 333 222 777]

In [172]:
print(df['col2'].value_counts())

666    3
555    2
444    2
777    1
333    1
222    1
Name: col2, dtype: int64

# Applying a function
pandas work with apply method to accept any user defined functions

In [173]:
def testfunc(x):
    if(x>500):
        return (10*np.log10(x))
    else:
        return(x/10)

In [200]:
print(df,end="\n\n")
df['FuncApplied']=df['col2'].apply(testfunc)
#df.drop('col1',axis=1,inplace=True)
print(df)

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

   col1  col2  col3  FuncApplied
0     1   444   aaa    44.400000
1     2   555    bb    27.442930
2     3   666     c    28.234742
3     4   444    dd    44.400000
4     5   333  eeee    33.300000
5     6   222   fff    22.200000
6     7   666    gg    28.234742
7     8   777     h    28.904210
8     9   666   iii    28.234742
9    10   555     j    27.442930

In [190]:
df['col3length']=df['col3'].apply(len)
df

   col1  col2  col3  FuncApplied  col3length
0     1   444   aaa    44.400000           3
1     2   555    bb    27.442930           2
2     3   666     c    28.234742           1
3     4   444    dd    44.400000           2
4     5   333  eeee    33.300000           4
5     6   222   fff    22.200000           3
6     7   666    gg    28.234742           2
7     8   777     h    28.904210           1
8     9   666   iii    28.234742           3
9    10   555     j    27.442930           1

# Standard statistical functions diretly applied to columns

In [192]:
print(df['FuncApplied'].sum()) #returns sum
print(df['FuncApplied'].mean())
print(df['FuncApplied'].std())  
print(df['FuncApplied'].min() , df['FuncApplied'].max())

312.7942967255717
31.27942967255717
7.4065059423607895
22.2 44.4

# Find Null Values or check for Null Values

In [211]:
df.isnull() #if they  are null it returns true
print(df)
df.fillna("0") #fills empty spaces with 0

   col1  col2  col3  FuncApplied
0     1   444   aaa          NaN
1     2   555    bb          NaN
2     3   666     c          NaN
3     4   444    dd          NaN
4     5   333  eeee          NaN
5     6   222   fff          NaN
6     7   666    gg          NaN
7     8   777     h          NaN
8     9   666   iii          NaN
9    10   555     j          NaN

In [ ]:
df=pd.DataFrame(data=data).transpose()
df.to_csv("name of file example data.csv") #saving data as .csv file 
#or writing
dat=pd.read_csv('data.csv',index_col=0) #reading file
df.to_excel('data.xlsx') similarly to_json 
and then to see the data use pd.read_csv
pd.read_pickle() to_pickle